Documents/РасходСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>РасходСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДеньгиОстатки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыОборот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПозицииРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХраненияСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Средства</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТабличнаяЧастьПриИзменении(Элемент)
	      
	Если Элементы.ТабличнаяЧасть.ТекущийЭлемент.Имя = "ТабличнаяЧастьКоличество" Тогда
		
		Если ЗначениеЗаполнено(Элементы.ТабличнаяЧасть.ТекущиеДанные.Цена) Тогда
			Элементы.ТабличнаяЧасть.ТекущиеДанные.Средства = Элементы.ТабличнаяЧасть.ТекущиеДанные.Цена * 	Элементы.ТабличнаяЧасть.ТекущиеДанные.Количество; 	
		КонецЕсли; 
		
	ИначеЕсли Элементы.ТабличнаяЧасть.ТекущийЭлемент.Имя = "ТабличнаяЧастьЦена" Тогда
		
		Если ЗначениеЗаполнено(Элементы.ТабличнаяЧасть.ТекущиеДанные.Количество) Тогда
			Элементы.ТабличнаяЧасть.ТекущиеДанные.Средства = Элементы.ТабличнаяЧасть.ТекущиеДанные.Цена * 	Элементы.ТабличнаяЧасть.ТекущиеДанные.Количество; 	
		КонецЕсли; 	
		
	ИначеЕсли Элементы.ТабличнаяЧасть.ТекущийЭлемент.Имя = "ТабличнаяЧастьСредства" Тогда	
		
		Если ЗначениеЗаполнено(Элементы.ТабличнаяЧасть.ТекущиеДанные.Количество)  Тогда
			Элементы.ТабличнаяЧасть.ТекущиеДанные.Цена = Элементы.ТабличнаяЧасть.ТекущиеДанные.Средства  /  Элементы.ТабличнаяЧасть.ТекущиеДанные.Количество;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Объект.СуммаДокумента = Объект.ТабличнаяЧасть.Итог("Средства");
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	х = 0;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	х = 0;

КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	х = 0;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	х = 0;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	х = 0;

КонецПроцедуры
